---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.CannotPlaceAreaReininforcementWarn
source: html/618c5aac-a3e8-5daf-ed76-fa14e54a95d9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.CannotPlaceAreaReininforcementWarn Property

Can't find a host for Area Reinforcement.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPlaceAreaReininforcementWarn { get; }
```